goals-app-api/app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jsldjf"], ["LIMIT", 1]]
---
	def create #log in
		user = User.find_by(username: session_params[:username])