goals-app-api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Tzuyu"], ["email", "twice"], ["created_at", "2020-01-17 07:07:52.515712"], ["updated_at", "2020-01-17 07:07:52.515712"]]
---
		def create
			@user = User.create(user_params)

UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Tzuyu"], ["updated_at", "2020-01-17 06:08:03.818191"], ["id", 1]]
---
		def update
			if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
		def set_user
			@user = User.find_by_id(params[:id])